[
  {
    "id": "prob_con_bernoulli_001",
    "subject": "probability",
    "type": "concept",
    "chapter": "discrete_random_variables",
    "topic": "bernoulli",
    "title": "Bernoulli Distribution",
    "contentHtml": "<p>The Bernoulli distribution is a fundamental concept in probability theory that models the outcome of a random experiment with only two possible outcomes: success or failure.</p><p>It's named after Jacob Bernoulli, who first introduced it in the 17th century. The distribution is characterized by a single parameter, p, which represents the probability of success.</p>",
    "formula": "{",
    "latex": "\\\\[ P(X=1) = p, \\quad P(X=0) = 1-p \\\\]\",",
    "name": "Bernoulli Distribution\" },",
    "intuition": "The Bernoulli distribution is useful when modeling binary outcomes, such as a coin toss or a patient's response to a treatment. It provides a simple way to quantify the uncertainty in these outcomes.",
    "realWorldApplications": [
      "In machine learning, the Bernoulli distribution is used to model binary classification problems, such as spam vs. non-spam emails."
    ],
    "commonMistakes": [
      "Don't confuse the Bernoulli distribution with the binomial distribution, which models the number of successes in multiple trials."
    ],
    "difficulty": 1,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T23:02:36.365Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "prob_con_bernoulli_002",
    "subject": "probability",
    "type": "concept",
    "chapter": "discrete_random_variables",
    "topic": "bernoulli",
    "title": "Bernoulli Distribution",
    "contentHtml": "<p>The Bernoulli distribution is a fundamental concept in probability theory that models the outcome of a single trial with two possible outcomes: success or failure.</p><p>Formally, let X be a random variable representing the outcome of this trial. The Bernoulli distribution is defined by the probability mass function:</p>\\(\\mathbb{P}(X=1) = p\\), \\(\\mathbb{P}(X=0) = 1-p\\)<p>In other words, the probability of success is p, and the probability of failure is 1-p.</p>\",",
    "formula": "{",
    "latex": "\\mathbb{E}[X] = p\",",
    "name": "Expectation\" },",
    "intuition": "The Bernoulli distribution provides a simple yet powerful way to model binary outcomes in various fields, including machine learning and artificial intelligence. For instance, it can be used to represent the outcome of a classification algorithm or the success/failure of a recommendation system.",
    "realWorldApplications": [
      "Classification algorithms",
      "Recommendation systems"
    ],
    "commonMistakes": [
      "Confusing Bernoulli with binomial distribution"
    ],
    "difficulty": 1,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T23:02:54.644Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "prob_con_bernoulli_003",
    "subject": "probability",
    "type": "concept",
    "chapter": "discrete_random_variables",
    "topic": "bernoulli",
    "title": "Bernoulli Distribution",
    "contentHtml": "<p>The Bernoulli distribution is a fundamental concept in probability theory that describes the outcome of a single trial with two possible outcomes: success or failure.</p><p>It's named after Swiss mathematician Jacob Bernoulli, who first introduced it in the 17th century. The distribution is characterized by a single parameter p, which represents the probability of success.</p>",
    "formula": "{",
    "latex": "\\\\[ P(X=1) = p, \\quad P(X=0) = 1-p \\\\]\",",
    "name": "Bernoulli Distribution Formula\" },",
    "intuition": "The Bernoulli distribution is useful when modeling binary outcomes, such as a coin flip or a patient's response to a treatment. It provides a simple way to calculate the probability of success or failure.",
    "realWorldApplications": [
      "In machine learning, the Bernoulli distribution is used in logistic regression and other classification algorithms."
    ],
    "commonMistakes": [
      "Failing to recognize that p is a probability between 0 and 1"
    ],
    "difficulty": 1,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T23:03:12.283Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  }
]