[
  {
    "id": "prob_con_binomial_001",
    "subject": "probability",
    "type": "concept",
    "chapter": "discrete_random_variables",
    "topic": "binomial",
    "title": "Binomial Distribution",
    "contentHtml": "<p>The binomial distribution is a fundamental concept in probability theory that models the number of successes in a fixed number of independent trials, where each trial has a constant probability of success.</p><p>Formally, let X be the random variable representing the number of successes in n independent trials, each with a probability p of success. The binomial distribution is characterized by the probability mass function:</p>\\(P(X=k) = \\binom{n}{k} p^k (1-p)^{n-k}\\)<p>This formula shows that the probability of k successes out of n trials depends on the number of ways k successes can occur among n trials, and the probability of each success or failure.</p>\",",
    "formula": "{",
    "latex": "\\(P(X=k) = \\binom{n}{k} p^k (1-p)^{n-k}\\)\",",
    "name": "Binomial Distribution Formula\" },",
    "whyMatters": "<p>The binomial distribution has numerous applications in machine learning and artificial intelligence, such as modeling the number of positive examples in a dataset or the number of correct predictions in a classification model.</p>",
    "intuition": "<p>Think of flipping a coin multiple times. The binomial distribution helps us understand the probability of getting a certain number of heads (or tails) given the number of flips and the probability of heads on each flip.</p>",
    "difficulty": 2,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T23:05:34.247Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "prob_con_binomial_002",
    "subject": "probability",
    "type": "concept",
    "chapter": "discrete_random_variables",
    "topic": "binomial",
    "title": "Binomial Distribution",
    "contentHtml": "<p>The binomial distribution is a discrete probability distribution that models the number of successes in a fixed number of independent trials, where each trial has a constant probability of success.</p><p>For example, flipping a fair coin 10 times can be modeled using the binomial distribution to calculate the probability of getting exactly 5 heads or tails.</p>",
    "formula": {
      "latex": "\\[ P(X=k) = \\binom{n}{k} p^k (1-p)^{n-k} \\]",
      "name": "Binomial Probability Formula"
    },
    "intuition": "The binomial distribution is useful when you want to calculate the probability of a specific number of successes in a fixed number of trials, where each trial has a constant probability of success.",
    "realWorldApplications": [
      "In machine learning, the binomial distribution can be used to model the number of positive or negative samples in a dataset."
    ],
    "commonMistakes": [
      "Not accounting for the independence of trials",
      "Assuming the probability of success is not constant"
    ],
    "estimatedMinutes": 2,
    "difficulty": 2,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T23:05:51.148Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "prob_con_binomial_003",
    "subject": "probability",
    "type": "concept",
    "chapter": "discrete_random_variables",
    "topic": "binomial",
    "title": "Binomial Distribution",
    "contentHtml": "<p>The binomial distribution is a discrete probability distribution that models the number of successes in a fixed number of independent trials, where each trial has a constant probability of success.</p><p>This concept matters because it's widely used in machine learning and AI to model binary outcomes, such as predicting whether a customer will purchase a product or not.</p>",
    "formula": "{",
    "latex": "\\\\[P(X=k) = \\\\binom{n}{k} p^k (1-p)^{n-k}\\]\",",
    "name": "Binomial Probability Formula\" },",
    "intuition": "The binomial distribution is like flipping a coin multiple times. Each flip has a certain probability of landing heads or tails, and the number of heads or tails follows a binomial distribution.",
    "realWorldApplications": [
      "Predicting customer purchases in e-commerce"
    ],
    "commonMistakes": [
      "Forgetting that the trials are independent",
      "Not accounting for the constant probability of success"
    ],
    "difficulty": 2,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T23:06:07.044Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  }
]