[
  {
    "id": "prob_con_hypergeometric_001",
    "subject": "probability",
    "type": "concept",
    "chapter": "discrete_random_variables",
    "topic": "hypergeometric",
    "title": "Hypergeometric Distribution",
    "contentHtml": "<p>The hypergeometric distribution is a fundamental concept in probability theory that arises when we sample without replacement from a finite population.</p><p>Imagine you're drawing cards from a deck without shuffling, and you want to know the probability of getting exactly <i>k</i> Aces. The hypergeometric distribution helps us calculate this probability.</p>",
    "formula": {
      "latex": "\\[P(X=k) = \\frac{{k\\choose r} {N-k\\choose M-r}}{{N\\choose M}}\\]",
      "name": "Hypergeometric Probability"
    },
    "intuition": "The hypergeometric distribution is useful when we want to understand the probability of getting a certain number of successes in a sample, without replacement, from a finite population.",
    "realWorldApplications": [
      "In machine learning, the hypergeometric distribution can be used to model the probability of selecting a rare class label from a dataset."
    ],
    "commonMistakes": [
      "Failing to account for the finite nature of the population when sampling without replacement"
    ],
    "estimatedMinutes": 2,
    "difficulty": 2,
    "mlRelevance": "useful",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T23:27:58.501Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "prob_con_hypergeometric_002",
    "subject": "probability",
    "type": "concept",
    "chapter": "discrete_random_variables",
    "topic": "hypergeometric",
    "title": "Hypergeometric Distribution",
    "contentHtml": "<p>The hypergeometric distribution models the probability of drawing a specific number of successes from a finite population without replacement.</p><p>For example, imagine you have a deck of cards with 10 red cards and 10 blue cards. You draw 3 cards randomly without replacing them. What's the probability that exactly 2 are red?</p>",
    "formula": {
      "latex": "\\[P(X=k) = \\frac{{k\\choose r} {N-k\\choose n-r}}{{N\\choose n}}\\]",
      "name": "Hypergeometric Probability"
    },
    "intuition": "The hypergeometric distribution is useful when you have a finite population and want to account for the fact that drawing one item affects the probability of drawing others.",
    "realWorldApplications": [
      "In recommender systems, the hypergeometric distribution can be used to model the probability of a user interacting with a specific item given their past behavior."
    ],
    "commonMistakes": [
      "Failing to account for the finite population size"
    ],
    "estimatedMinutes": 2,
    "difficulty": 2,
    "mlRelevance": "useful",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T23:28:15.421Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "prob_con_hypergeometric_003",
    "subject": "probability",
    "type": "concept",
    "chapter": "discrete_random_variables",
    "topic": "hypergeometric",
    "title": "Hypergeometric Distribution",
    "contentHtml": "<p>The hypergeometric distribution is a fundamental concept in probability theory that arises when sampling without replacement from a finite population.</p><p>Imagine you have a deck of cards with <i>n</i> distinct types, and you randomly draw <i>k</i> cards without replacing them. The hypergeometric distribution describes the probability of drawing exactly <i>r</i> cards of one particular type (e.g., hearts) given that there are <i>m</i> such cards in the deck.</p>",
    "formula": {
      "latex": "\\[P(X=r)=\\frac{\\binom{m}{r} \\binom{n-m}{k-r}}{\\binom{n}{k}}\\]",
      "name": "Hypergeometric Probability"
    },
    "intuition": "The hypergeometric distribution is useful when you need to account for the fact that sampling without replacement can affect the probability of drawing certain items.",
    "realWorldApplications": [
      "In machine learning, the hypergeometric distribution is used in anomaly detection and rare event analysis."
    ],
    "commonMistakes": [
      "Failing to account for the finite population size when sampling without replacement"
    ],
    "estimatedMinutes": 2,
    "difficulty": 2,
    "mlRelevance": "useful",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T23:28:34.509Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  }
]