[
  {
    "id": "la_con_transformation_definition_001",
    "subject": "linear_algebra",
    "type": "concept",
    "chapter": "linear_transformations",
    "topic": "transformation_definition",
    "title": "Linear Transformations: Definition and Linearity Conditions",
    "contentHtml": "<p>A linear transformation is a fundamental concept in linear algebra that represents a way to transform vectors from one space to another while preserving certain properties.</p><p>Formally, a function T: ℝⁿ → ℝᵐ between two vector spaces is called a linear transformation if it satisfies the following conditions:</p><ul><li>\\(T(\\mathbf{u} + \\mathbf{v}) = T(\\mathbf{u}) + T(\\mathbf{v})\\)</li><li>\\(T(c \\mathbf{u}) = c T(\\mathbf{u})\\)</li></ul><p>These conditions ensure that the transformation is linear, meaning it preserves the operations of vector addition and scalar multiplication.</p>\",",
    "formula": "{",
    "latex": "\\(T(\\mathbf{u} + \\mathbf{v}) = T(\\mathbf{u}) + T(\\mathbf{v})\\)\",",
    "name": "Linearity Condition 1",
    "variants": "[] },",
    "intuition": "Think of a linear transformation as a machine that takes in vectors and outputs new vectors, while maintaining the relationships between them.",
    "realWorldApplications": [
      "In machine learning, linear transformations are used to map input data to higher-dimensional spaces for better feature extraction and classification."
    ],
    "commonMistakes": [
      "Don't confuse linearity with continuity or differentiability; these concepts have distinct properties."
    ],
    "difficulty": 2,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T10:38:01.824Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "la_con_transformation_definition_002",
    "subject": "linear_algebra",
    "type": "concept",
    "chapter": "linear_transformations",
    "topic": "transformation_definition",
    "title": "Linear Transformations: What is a Linear Transformation?",
    "contentHtml": "<p>A linear transformation is a fundamental concept in linear algebra that describes a way to transform vectors from one space to another while preserving certain properties.</p><p>Formally, a linear transformation T from vector space V to W is defined as:</p>\\(T: \\mathbf{v} \\mapsto A\\mathbf{v}\\) where A is an m x n matrix and v is a column vector in R^n.\\(<p>This means that the image of every vector under T is another vector, which can be computed by multiplying the original vector with the matrix A.</p>\",",
    "formula": "{",
    "latex": "\\(T: \\mathbf{v} \\mapsto A\\mathbf{v}\\)\",",
    "name": "Linear Transformation Definition\" },",
    "intuition": "Think of a linear transformation as a machine that takes in vectors and produces new vectors by applying the matrix multiplication. This process preserves the vector space properties, making it a crucial concept in many applications.",
    "realWorldApplications": [
      "In machine learning, linear transformations are used to map input data into a higher-dimensional space for better feature extraction."
    ],
    "commonMistakes": [
      "Don't confuse linearity with linearity of a function; these are different concepts."
    ],
    "difficulty": 2,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T10:38:20.176Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "la_con_transformation_definition_003",
    "subject": "linear_algebra",
    "type": "concept",
    "chapter": "linear_transformations",
    "topic": "transformation_definition",
    "title": "Linear Transformations: Definition and Linearity Conditions",
    "contentHtml": "<p>A linear transformation is a function between vector spaces that preserves the operations of addition and scalar multiplication.</p><p>In other words, it's a way to transform vectors from one space to another while maintaining their relationships.</p>",
    "formula": "{",
    "latex": "\\\\[ T:\\\\mathbf{V} \\\\to \\\\mathbf{W}, \\quad T(\\\\alpha \\\\mathbf{v} + \\\\beta \\\\mathbf{u}) = \\\\alpha T(\\\\mathbf{v}) + \\\\beta T(\\\\mathbf{u}) \\\\]\" },",
    "intuition": "Think of a linear transformation as a machine that takes in vectors and outputs new vectors, while respecting the rules of vector addition and scalar multiplication.",
    "realWorldApplications": [
      "Linear transformations are used extensively in machine learning to transform data from one representation to another."
    ],
    "commonMistakes": [
      "Don't confuse linearity with continuity or differentiability."
    ],
    "difficulty": 2,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T10:38:35.175Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  }
]