[
  {
    "id": "stat_con_data_types_001",
    "subject": "statistics",
    "type": "concept",
    "chapter": "descriptive_statistics",
    "topic": "data_types",
    "title": "Types of Data",
    "contentHtml": "<p>In statistics, data can be categorized into four main types: categorical, ordinal, interval, and ratio scales.</p><p>Categorical data represents categories or labels, such as colors (red, green, blue) or eye colors (blue, brown, hazel). Ordinal data has a natural order or ranking, like exam scores (A-F) or job titles (intern, manager, CEO).</p><p>Interval and ratio scales have meaningful differences between consecutive values. Examples include temperatures in Celsius or Fahrenheit, and measurements of physical quantities.</p>",
    "formula": {
      "latex": ""
    },
    "intuition": "Understanding the type of data is crucial for proper analysis and interpretation.",
    "realWorldApplications": [
      "In machine learning, knowing the type of data helps determine the appropriate algorithms to use.",
      "For instance, using a clustering algorithm on categorical data might not be effective."
    ],
    "commonMistakes": [
      "Failing to recognize the type of data can lead to incorrect conclusions or misinterpretation."
    ],
    "estimatedMinutes": 2,
    "difficulty": 1,
    "mlRelevance": "important",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T08:19:18.547Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "stat_con_data_types_002",
    "subject": "statistics",
    "type": "concept",
    "chapter": "descriptive_statistics",
    "topic": "data_types",
    "title": "Types of Data",
    "contentHtml": "<p>Data can be categorized into four main types: categorical, ordinal, interval, and ratio scales.</p><p>A <em>categorical scale</em> represents data that is qualitative, such as colors or species. Values are distinct categories rather than numerical values.</p><p>An <em>ordinal scale</em> represents ordered data where the difference between consecutive values has meaning, but not necessarily equal intervals. Examples include survey responses (e.g., 1-5) or rankings.</p><p>An <em>interval scale</em> represents data with equal intervals between consecutive values, but no absolute zero point. Examples include temperatures in Celsius or Fahrenheit.</p><p>A <em>ratio scale</em> represents data with both equal intervals and an absolute zero point. Examples include lengths measured in meters or weights measured in kilograms.</p>",
    "formula": {
      "latex": "\\[ \\text{ } \\]",
      "name": ""
    },
    "intuition": "Understanding the type of data is crucial for selecting appropriate statistical methods, visualizations, and machine learning algorithms.",
    "realWorldApplications": [
      "In natural language processing, understanding the categorical nature of text data can inform topic modeling and sentiment analysis"
    ],
    "tags": [
      "data",
      "statistics"
    ],
    "estimatedMinutes": 2,
    "difficulty": 1,
    "mlRelevance": "important",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T08:19:34.823Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "stat_con_data_types_003",
    "subject": "statistics",
    "type": "concept",
    "chapter": "descriptive_statistics",
    "topic": "data_types",
    "title": "Types of Data",
    "contentHtml": "<p>In statistics, data can be categorized into four main types: categorical, ordinal, interval, and ratio scales.</p><p>Understanding these differences is crucial for proper analysis and interpretation.</p>",
    "formula": "{",
    "latex": "\\(y = \\frac{\\text{sum of all values}}{\\text{number of values}}\\)\",",
    "name": "Mean\" },",
    "intuition": "These types determine how we can reasonably compare or combine data points.",
    "realWorldApplications": [
      "In machine learning, understanding the type of data is crucial for selecting appropriate algorithms and preprocessing techniques."
    ],
    "commonMistakes": [
      "Failing to recognize the type of data can lead to incorrect conclusions or misinterpretation."
    ],
    "difficulty": 1,
    "mlRelevance": "important",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T08:19:46.373Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  }
]