[
  {
    "id": "la_con_matrix_multiplication_001",
    "subject": "linear_algebra",
    "type": "concept",
    "chapter": "matrices_fundamentals",
    "topic": "matrix_multiplication",
    "title": "Matrix Multiplication",
    "contentHtml": "<p>Matrix multiplication is a fundamental operation in linear algebra that allows us to combine two matrices into one new matrix.</p><p>The row-column rule states that we multiply corresponding elements from the rows of the first matrix and the columns of the second matrix, adding them up accordingly.</p>",
    "formula": "{",
    "latex": "\\\\[\\\\mathbf{C} = \\\\mathbf{A} \\\\cdot \\\\mathbf{B}\\]\",",
    "name": "Matrix Multiplication\" },",
    "intuition": "Think of it like a recipe: you take the rows of one matrix and the columns of another, multiply them together element-wise, and then add up all those products to get each new entry in the resulting matrix.",
    "realWorldApplications": [
      "Machine learning models often rely on matrix multiplication for tasks like neural network computations."
    ],
    "commonMistakes": [
      "Don't forget that matrices don't commute; the order of multiplication matters!"
    ],
    "difficulty": 2,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T10:02:21.059Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "la_con_matrix_multiplication_002",
    "subject": "linear_algebra",
    "type": "concept",
    "chapter": "matrices_fundamentals",
    "topic": "matrix_multiplication",
    "title": "Matrix Multiplication",
    "contentHtml": "<p>Matrix multiplication is a fundamental operation in linear algebra that allows us to combine two matrices into a single resulting matrix.</p><p>The row-column rule states that we multiply corresponding rows of the first matrix with corresponding columns of the second matrix, summing up the products to get each entry in the resulting matrix.</p>",
    "formula": {
      "latex": "\\[\\mathbf{C} = \\mathbf{AB}\\]",
      "name": "Matrix Multiplication"
    },
    "intuition": "Think of it like a recipe: you're combining two matrices to create a new one. You take each row of the first matrix, multiply it with each column of the second matrix, and then add up all those products to get the corresponding entry in the resulting matrix.",
    "realWorldApplications": [
      "In machine learning, matrix multiplication is used extensively for tasks like neural network computations, natural language processing, and recommender systems."
    ],
    "commonMistakes": [
      "Don't forget that matrices don't commute; the order of multiplication matters!"
    ],
    "estimatedMinutes": 2,
    "difficulty": 2,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T10:02:36.706Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "la_con_matrix_multiplication_003",
    "subject": "linear_algebra",
    "type": "concept",
    "chapter": "matrices_fundamentals",
    "topic": "matrix_multiplication",
    "title": "Matrix Multiplication",
    "contentHtml": "<p>Matrix multiplication is a fundamental operation in linear algebra that combines two matrices into one. It's a crucial concept to understand because it allows us to perform complex computations and transformations on data.</p><p>The key idea behind matrix multiplication is the row-column rule: each element of the resulting matrix is the dot product of the corresponding row of the first matrix and the corresponding column of the second matrix.</p>",
    "formula": {
      "latex": "\\[\\mathbf{C} = \\mathbf{AB}\\]",
      "name": "Matrix Multiplication"
    },
    "intuition": "Think of matrix multiplication as a way to combine two matrices by matching rows and columns. Each element in the resulting matrix represents the weighted sum of elements from the input matrices.",
    "realWorldApplications": [
      "Machine learning models often rely on matrix multiplications for computations, such as neural network layers."
    ],
    "commonMistakes": [
      "Don't confuse matrix multiplication with element-wise multiplication or addition."
    ],
    "estimatedMinutes": 2,
    "difficulty": 2,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T10:02:51.928Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  }
]