[
  {
    "id": "prob_con_multinomial_001",
    "subject": "probability",
    "type": "concept",
    "chapter": "probability_foundations",
    "topic": "multinomial",
    "title": "Multinomial Coefficients: Partitioning Objects",
    "contentHtml": "<p>When dealing with multiple categories or outcomes, it's essential to understand how to partition objects and calculate the corresponding probabilities. This concept is crucial in probability theory and has numerous applications in machine learning and artificial intelligence.</p><p>The multinomial coefficient represents the number of ways to arrange objects into distinct categories. It's a fundamental idea that helps us count the possible outcomes when dealing with multiple events or features.</p>",
    "formula": {
      "latex": "\\binom{n+k-1}{k} = \\frac{(n+k-1)!}{(k)!(n-1)!}",
      "name": "Multinomial Coefficient",
      "variants": []
    },
    "intuition": "Think of it like arranging objects into labeled bins. The multinomial coefficient tells us how many ways we can distribute the objects across these bins.",
    "realWorldApplications": [
      "In natural language processing, multinomial coefficients are used to model the probability distribution of words in a document."
    ],
    "tags": [
      "probability",
      "combinatorics"
    ],
    "estimatedMinutes": 2,
    "difficulty": 2,
    "mlRelevance": "useful",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T21:49:04.696Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "prob_con_multinomial_002",
    "subject": "probability",
    "type": "concept",
    "chapter": "probability_foundations",
    "topic": "multinomial",
    "title": "Multinomial Coefficients: Partitioning Objects",
    "contentHtml": "<p>In probability theory, multinomial coefficients are used to count the number of ways to partition objects into distinct categories.</p><p>Given a set of <i>n</i> objects and <i>k</i> categories, we can calculate the number of ways to assign each object to exactly one category using multinomial coefficients.</p>",
    "formula": {
      "latex": "\\binom{n+k-1}{k-1}",
      "name": "Multinomial Coefficient",
      "variants": [
        {
          "latex": "\\frac{(n+k-1)!}{(k-1)!(n-1)!}",
          "description": "Factorial representation"
        }
      ]
    },
    "intuition": "Think of it like counting the number of ways to distribute <i>n</i> distinct objects into <i>k</i> labeled boxes. The multinomial coefficient gives us the number of possible assignments.",
    "realWorldApplications": [
      "In machine learning, multinomial coefficients are used in topic modeling and document clustering."
    ],
    "commonMistakes": [
      "Don't confuse this with binomial coefficients, which count the number of ways to choose items from two categories."
    ],
    "estimatedMinutes": 2,
    "difficulty": 2,
    "mlRelevance": "useful",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T21:49:23.442Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "prob_con_multinomial_003",
    "subject": "probability",
    "type": "concept",
    "chapter": "probability_foundations",
    "topic": "multinomial",
    "title": "Multinomial Coefficients: Partitioning Objects",
    "contentHtml": "<p>In probability theory, multinomial coefficients arise when partitioning a set of objects into distinct categories or classes.</p><p>Given a finite set of objects and a partitioning scheme, the multinomial coefficient counts the number of ways to distribute these objects among the categories while respecting the partitioning constraints.</p>",
    "formula": {
      "latex": "\\binom{n}{k_1,k_2,...,k_m} = \\frac{n!}{k_1! k_2! ... k_m!}",
      "name": "Multinomial Coefficient",
      "variants": []
    },
    "intuition": "Think of it like organizing a set of colored balls into different bins. The multinomial coefficient tells you how many ways you can do this, given the number of balls and bins.",
    "realWorldApplications": [
      "In natural language processing, multinomial coefficients are used in topic modeling to partition documents into topics"
    ],
    "commonMistakes": [
      "Don't confuse multinomial coefficients with binomial coefficients; they have different meanings and applications"
    ],
    "estimatedMinutes": 2,
    "difficulty": 2,
    "mlRelevance": "useful",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T21:49:41.121Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  }
]