[
  {
    "id": "la_con_finding_eigenvectors_001",
    "subject": "linear_algebra",
    "type": "concept",
    "chapter": "eigentheory",
    "topic": "finding_eigenvectors",
    "title": "Finding Eigenvectors: Null Space and Geometric Multiplicity",
    "contentHtml": "<p>Eigenvectors are crucial in linear algebra, as they help us understand how matrices transform vectors.</p><p>To find an eigenvector of a square matrix A corresponding to an eigenvalue λ, we need to solve the equation (A - λI)v = 0, where I is the identity matrix. This equation represents the null space of (A - λI), which contains all possible eigenvectors.</p>",
    "formula": "{",
    "latex": "\\(v \\in N(A - \\lambda I) \\Rightarrow (A - \\lambda I)v = 0\\)\",",
    "name": "Eigenvector Equation\" },",
    "intuition": "Think of the null space as a set of vectors that remain unchanged when transformed by A, except for scaling. Eigenvectors are special cases where the transformation is just a scalar multiplication.",
    "realWorldApplications": [
      "In machine learning, eigenvectors help in dimensionality reduction and feature extraction."
    ],
    "commonMistakes": [
      "Don't confuse eigenvectors with null vectors; they're not the same thing."
    ],
    "difficulty": 3,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T12:27:01.205Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "la_con_finding_eigenvectors_002",
    "subject": "linear_algebra",
    "type": "concept",
    "chapter": "eigentheory",
    "topic": "finding_eigenvectors",
    "title": "Finding Eigenvectors",
    "contentHtml": "<p>Finding eigenvectors is a crucial step in understanding the behavior of linear transformations. In essence, we're searching for non-zero vectors that, when transformed by the matrix A, get scaled by some factor λ.</p><p>Geometrically, this means finding directions in which the transformation stretches or shrinks the original vector.</p>",
    "formula": "{",
    "latex": "\\(A \\mathbf{v} = \\lambda \\mathbf{v}\\)\",",
    "name": "Eigenvector Equation",
    "variants": "[] },",
    "intuition": "Think of eigenvectors as special directions in which the transformation acts. By finding these directions, we can better understand how the transformation changes the original vector.",
    "realWorldApplications": [
      "In machine learning, eigenvectors are used to reduce dimensionality and identify patterns in data"
    ],
    "commonMistakes": [
      "Failing to normalize the eigenvector",
      "Not accounting for geometric multiplicity"
    ],
    "difficulty": 3,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T12:27:17.341Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "la_con_finding_eigenvectors_003",
    "subject": "linear_algebra",
    "type": "concept",
    "chapter": "eigentheory",
    "topic": "finding_eigenvectors",
    "title": "Finding Eigenvectors: Null Space of (A - λI)",
    "contentHtml": "<p>Eigenvectors are vectors that, when transformed by a linear transformation A, scale up or down but do not change direction.</p><p>To find an eigenvector, we need to find the non-zero vector v such that (A - λI)v = 0. This is equivalent to finding the null space of (A - λI).</p>",
    "formula": "{",
    "latex": "\\(v \\in N(A - \\lambda I) \\Rightarrow (A - \\lambda I)v = 0\\)\",",
    "name": "Eigenvector Equation\" },",
    "intuition": "Think of eigenvectors as the directions in which a linear transformation stretches or shrinks. The null space of (A - λI) tells us where these directions are.",
    "realWorldApplications": [
      "Principal component analysis (PCA) in machine learning uses eigenvectors to find the most important features"
    ],
    "commonMistakes": [
      "Failing to recognize that eigenvectors can be scaled by any non-zero constant"
    ],
    "difficulty": 3,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T12:27:33.594Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  }
]