[
  {
    "id": "stat_prb_regression_assumptions_006",
    "subject": "statistics",
    "type": "problem",
    "chapter": "regression",
    "topic": "regression_assumptions",
    "problem": {
      "statementHtml": "<p>Assume you have a dataset of exam scores and corresponding hours studied by students. Can you verify that the linear regression assumptions are met?</p>",
      "hints": [
        "Check if there's any obvious non-linear relationship between hours studied and exam scores.",
        "Verify that each student's data point is independent and not correlated with others.",
        "Look for any outliers or anomalies in the data."
      ],
      "solutionHtml": "<p>To verify linearity, we can plot the data points and check if they form a straight line. For independence, we can use the residuals to ensure there's no correlation between them.</p><p>For normality, we can perform a Shapiro-Wilk test or visually inspect the distribution of residuals. Finally, for homoscedasticity, we can plot the residuals against fitted values and check if they're constant.</p>",
      "answerShort": "Verify linearity by plotting data points, independence by checking residuals, normality by testing or visual inspection, and homoscedasticity by plotting residuals vs. fitted values."
    },
    "difficulty": 3,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T22:38:06.647Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "stat_prb_regression_assumptions_007",
    "subject": "statistics",
    "type": "problem",
    "chapter": "regression",
    "topic": "regression_assumptions",
    "problem": {
      "statementHtml": "<p>Assume we have a linear regression model with one predictor variable. Which of the following assumptions must be met for the model to be valid?</p>",
      "hints": [
        "<p>The first assumption is about linearity.</p>",
        "<p>The second assumption ensures that observations are independent.</p>",
        "<p>Normality and homoscedasticity are also crucial assumptions.</p>"
      ],
      "solutionHtml": "<p>To check the linearity assumption, we can plot the residuals against the fitted values. If the points are randomly scattered around zero, then the linearity assumption is met.</p><p>To verify independence, we can use a scatterplot matrix to examine the relationships between variables.</p><p>Normality and homoscedasticity can be checked using statistical tests or visualizations.</p>",
      "answerShort": "Linearity, independence, normality, and homoscedasticity"
    },
    "commonMistakes": [
      "Failing to check for non-linearity in the relationship between variables",
      "Assuming that all assumptions are met without verifying them"
    ],
    "difficulty": 3,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T22:38:21.295Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "stat_prb_regression_assumptions_008",
    "subject": "statistics",
    "type": "problem",
    "chapter": "regression",
    "topic": "regression_assumptions",
    "problem": {
      "statementHtml": "<p>Check whether a given dataset satisfies the assumptions of linear regression.</p>",
      "hints": [
        "Verify that the relationship between variables is approximately linear.",
        "Ensure that each observation is independent and identically distributed (i.i.d.).",
        "Assess normality, homoscedasticity, and independence."
      ],
      "solutionHtml": "<p>To check linearity, plot the residuals against fitted values. For normality, use a Q-Q plot or Shapiro-Wilk test. Homoscedasticity can be checked by plotting residuals vs. fitted values (constant variance) or using Levene's test.</p>",
      "answerShort": "Linearity: linear plot; Normality: normal distribution; Homoscedasticity: constant variance"
    },
    "commonMistakes": [
      "Failing to check for non-linear relationships.",
      "Assuming normality without checking."
    ],
    "difficulty": 3,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T22:38:34.395Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "stat_prb_regression_assumptions_009",
    "subject": "statistics",
    "type": "problem",
    "chapter": "regression",
    "topic": "regression_assumptions",
    "problem": "{",
    "statementHtml": "Assume we have a linear regression model: \\(y = \\beta_0 + \\beta_1 x\\). Which of the following assumptions are necessary for the model to be valid?\",",
    "hints": [
      "Think about what happens when you draw the best-fitting line through the data.",
      "Consider how the residuals behave if the relationship isn't linear.",
      "Remember that normality is important for some statistical tests."
    ],
    "solutionHtml": "<p>To validate our model, we need to check four assumptions:</p><ul><li>\\(y = \\beta_0 + \\beta_1 x\\) must be a good approximation of the true relationship.</li><li>The residuals should be independent and identically distributed (i.i.d.).</li><li>The residuals should follow a normal distribution.</li><li>The variance of the residuals should be constant across all levels of \\(x\\).</li></ul>\",",
    "answerShort": "Linearity, independence, normality, homoscedasticity\" },",
    "difficulty": 3,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T22:38:49.678Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  }
]