[
  {
    "id": "stat_con_ci_normal_known_001",
    "subject": "statistics",
    "type": "concept",
    "chapter": "interval_estimation",
    "topic": "ci_normal_known",
    "title": "CI for Mean with Known Variance",
    "contentHtml": "<p>In statistics, we often want to estimate a population mean based on a sample of data. When the population variance is known, we can use Z-intervals to construct a confidence interval (CI) for the true mean.</p><p>A Z-interval is a type of interval estimation that uses the standard normal distribution (Z-distribution) to calculate the margin of error. This approach is particularly useful when the sample size is large and the population variance is known.</p>",
    "formula": "{",
    "latex": "\\[ \\bar{x} \\pm Z \\cdot \\frac{\\sigma}{\\sqrt{n}} \\]\",",
    "name": "Z-interval formula\" },",
    "intuition": "The key insight here is that when we know the population variance, we can use the standard normal distribution to calculate the margin of error. This allows us to construct a CI for the true mean with a specific level of confidence.",
    "realWorldApplications": [
      "In machine learning, Z-intervals are used in hypothesis testing and confidence intervals for model performance metrics."
    ],
    "commonMistakes": [
      "Failing to account for the known population variance when constructing the CI"
    ],
    "difficulty": 2,
    "mlRelevance": "important",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T10:04:48.332Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "stat_con_ci_normal_known_002",
    "subject": "statistics",
    "type": "concept",
    "chapter": "interval_estimation",
    "topic": "ci_normal_known",
    "title": "Confidence Intervals for Mean with Known Variance",
    "contentHtml": "<p>We're going to explore confidence intervals (CIs) for the mean of a population when we know the variance. This is a fundamental concept in statistical inference, and it has numerous applications in machine learning and artificial intelligence.</p><p>In particular, we'll focus on Z-intervals, which are widely used in practice due to their simplicity and accuracy.</p>",
    "formula": "{",
    "latex": "\\\\[ \\\\bar{x} \\pm Z \\\\cdot \\\\sqrt{\\\\frac{\\\\sigma^2}{n}} \\\\]\",",
    "name": "Z-Interval Formula\" },",
    "intuition": "The key insight is that the CI for the mean is a range of values within which we're confident (1 - α) that the true population mean lies. The Z-score plays a crucial role in determining this interval.",
    "visualDescription": "A diagram showing the distribution of sample means and the confidence interval would help illustrate the concept.",
    "commonMistakes": [
      "Failing to account for the known variance",
      "Using an incorrect Z-score or α-value"
    ],
    "realWorldApplications": [
      "Estimating the average user rating in a recommendation system",
      "Determining the mean response time of a machine learning model"
    ],
    "difficulty": 2,
    "mlRelevance": "important",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T10:05:04.873Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "stat_con_ci_normal_known_003",
    "subject": "statistics",
    "type": "concept",
    "chapter": "interval_estimation",
    "topic": "ci_normal_known",
    "title": "Confidence Intervals for Mean with Known Variance",
    "contentHtml": "<p>In statistics, we often want to estimate a population mean based on a sample of data. When the variance is known, we can construct a confidence interval (CI) using the Z-interval method.</p><p>The CI provides a range of values within which the true population mean is likely to lie. The width of the interval represents our uncertainty in the estimation process.</p>",
    "formula": {
      "latex": "\\[\\text{CI} = \\bar{x} \\pm Z \\cdot \\frac{\\sigma}{\\sqrt{n}}\\]",
      "name": "Z-interval formula"
    },
    "intuition": "Think of the CI as a 'window' around our sample mean. The width of this window depends on the known variance and the confidence level we choose.",
    "realWorldApplications": [
      "In machine learning, CIs are used to quantify the uncertainty in model predictions."
    ],
    "commonMistakes": [
      "Don't forget to account for the known variance when constructing the CI."
    ],
    "estimatedMinutes": 2,
    "difficulty": 2,
    "mlRelevance": "important",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T10:05:19.542Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  }
]