[
  {
    "id": "stat_con_ci_normal_unknown_001",
    "subject": "statistics",
    "type": "concept",
    "chapter": "interval_estimation",
    "topic": "ci_normal_unknown",
    "title": "Interval Estimation: CI for Mean (Unknown Variance)",
    "contentHtml": "<p>When we don't know the population variance, but still want to construct a confidence interval (CI) for the mean, we use the T-interval. This is a crucial concept in mathematical statistics.</p><p>The T-interval is based on the sample variance and provides an estimate of the population mean.</p>",
    "formula": {
      "latex": "\\[\\text{CI} = \\bar{x} \\pm t_{n-1, \\alpha/2} \\cdot \\frac{s}{\\sqrt{n}}\\]",
      "name": "T-interval formula"
    },
    "intuition": "The T-interval is a way to balance the uncertainty in our sample mean with the uncertainty in our sample variance. This allows us to construct a CI that captures the true population mean.",
    "realWorldApplications": [
      "In machine learning, we often use the T-interval to estimate the mean of a feature or target variable."
    ],
    "commonMistakes": [
      "Don't forget to account for the unknown population variance when constructing the CI."
    ],
    "estimatedMinutes": 2,
    "difficulty": 2,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T10:09:06.933Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "stat_con_ci_normal_unknown_002",
    "subject": "statistics",
    "type": "concept",
    "chapter": "interval_estimation",
    "topic": "ci_normal_unknown",
    "title": "T-Interval Estimation for Mean (Unknown Variance)",
    "contentHtml": "<p>In statistics, we often want to estimate a population mean when the variance is unknown. One way to do this is by using the T-interval estimation method.</p><p>This approach is particularly useful in machine learning and artificial intelligence applications where we need to make predictions about unseen data.</p>",
    "formula": "{",
    "latex": "\\\\[\\\\bar{x} - \\\\frac{t_{n-1, \\\\alpha}}{\\\\sqrt{n}} \\cdot s \\\\]\",",
    "name": "T-Interval Formula\" },",
    "intuition": "The T-interval provides a range of values within which the true population mean is likely to lie. This is especially useful when we have limited data and want to make inferences about the larger population.",
    "realWorldApplications": [
      "Estimating customer satisfaction scores based on a small sample size"
    ],
    "commonMistakes": [
      "Forgetting to adjust for the sample size",
      "Using the wrong value of t"
    ],
    "difficulty": 2,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T10:09:21.145Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "stat_con_ci_normal_unknown_003",
    "subject": "statistics",
    "type": "concept",
    "chapter": "interval_estimation",
    "topic": "ci_normal_unknown",
    "title": "T-Interval Estimation for Mean (Unknown Variance)",
    "contentHtml": "<p>In statistics, we often need to estimate a population mean when the variance is unknown. One common approach is to use the T-interval method.</p><p>The T-interval provides a range of values within which the true population mean is likely to lie. This is especially useful in machine learning and AI applications where we want to make predictions or classify data based on uncertain parameters.</p>",
    "formula": {
      "latex": "\\[\\bar{x} \\pm t \\cdot \\sqrt{\\frac{s^2}{n}}\\]",
      "name": "T-Interval Formula"
    },
    "intuition": "The T-interval is a way to quantify the uncertainty in our estimate of the population mean. By using the sample variance and the T-distribution, we can create a range of values that captures the variability in our data.",
    "realWorldApplications": [
      "In regression analysis, the T-interval can be used to construct confidence intervals for the coefficients of a linear model."
    ],
    "commonMistakes": [
      "Failing to account for the uncertainty in the sample variance"
    ],
    "estimatedMinutes": 2,
    "difficulty": 2,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T10:09:36.542Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  }
]