[
  {
    "id": "stat_con_sample_size_001",
    "subject": "statistics",
    "type": "concept",
    "chapter": "interval_estimation",
    "topic": "sample_size",
    "title": "Sample Size Determination",
    "contentHtml": "<p>In interval estimation, we often need to determine the sample size required to achieve a certain level of precision. This is crucial in many applications, including machine learning and artificial intelligence.</p><p>Given a desired margin of error and confidence level, we can calculate the required sample size using various formulas.</p>",
    "formula": "{",
    "latex": "\\\\[n = \\\\left(\\\\frac{Z^2 \\* p \\\\* (1-p)}{e^2}\\\\right)\\]\",",
    "name": "Sample Size Formula\" },",
    "intuition": "The key insight is that the sample size required increases with the desired precision and confidence level, but decreases as the population proportion approaches 0.5.",
    "realWorldApplications": [
      "In machine learning, determining the optimal sample size can significantly impact model performance and accuracy."
    ],
    "commonMistakes": [
      "Failing to account for the margin of error when calculating the required sample size"
    ],
    "estimatedMinutes": 2,
    "difficulty": 2,
    "mlRelevance": "important",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T10:30:19.052Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "stat_con_sample_size_002",
    "subject": "statistics",
    "type": "concept",
    "chapter": "interval_estimation",
    "topic": "sample_size",
    "title": "Sample Size Determination",
    "contentHtml": "<p>In interval estimation, we often need to determine the sample size required to achieve a certain precision and margin of error.</p><p>This is crucial in machine learning and artificial intelligence applications where small variations can significantly impact model performance.</p>",
    "formula": "{",
    "latex": "\\\\(n = \\\\frac{(Z_{1-\\\\alpha/2} \\* \\\\sigma)^2}{E^2}\\\\)\",",
    "name": "Sample Size Formula\" },",
    "intuition": "Think of it like trying to hit a target. You need to know the size of your dart (precision) and how far off you can be from the center (margin of error). The sample size formula helps you calculate how many darts you need to throw to achieve this level of accuracy.",
    "realWorldApplications": [
      "In ML/AI, determining the optimal sample size is crucial for model training and testing."
    ],
    "commonMistakes": [
      "Failing to account for margin of error in sample size calculations"
    ],
    "difficulty": 2,
    "mlRelevance": "important",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T10:30:33.319Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "stat_con_sample_size_003",
    "subject": "statistics",
    "type": "concept",
    "chapter": "interval_estimation",
    "topic": "sample_size",
    "title": "Sample Size Determination",
    "contentHtml": "<p>In interval estimation, we often need to determine the sample size required to achieve a certain level of precision. This is crucial in machine learning and artificial intelligence applications where small changes can have significant effects.</p><p>Given a desired margin of error and confidence level, we can calculate the minimum sample size needed using statistical formulas.</p>",
    "formula": "{",
    "latex": "\\\\[n = \\\\left(\\\\frac{Z^2 \\* p \\* (1-p)}{e^2}\\\\right)\\]\",",
    "name": "Sample Size Formula\" },",
    "intuition": "The key insight is that the sample size increases as the desired precision decreases, and vice versa.",
    "visualDescription": "A diagram showing a normal distribution with a confidence interval would help illustrate the concept.",
    "commonMistakes": [
      "Forgetting to account for the margin of error",
      "Not considering the impact of non-normality on the results"
    ],
    "realWorldApplications": [
      "Estimating the effectiveness of a new marketing campaign",
      "Determining the accuracy of a predictive model"
    ],
    "difficulty": 2,
    "mlRelevance": "important",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T10:30:48.254Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  }
]