[
  {
    "id": "prob_con_exponential_001",
    "subject": "probability",
    "type": "concept",
    "chapter": "continuous_random_variables",
    "topic": "exponential",
    "title": "Exponential Distribution",
    "contentHtml": "<p>The exponential distribution is a fundamental concept in probability theory that models the time between events in a memoryless system.</p><p>Imagine a clock ticking away, and each tick represents an event occurring. The exponential distribution describes the probability of the next tick happening at any given moment.</p>",
    "formula": {
      "latex": "\\[ f(x) = \\lambda e^{-\\lambda x} \\]",
      "name": "Exponential Density Function",
      "variants": []
    },
    "intuition": "The exponential distribution is memoryless because the probability of the next event occurring doesn't depend on when the previous event occurred. This property makes it a great model for systems where events occur independently.",
    "realWorldApplications": [
      "In reliability engineering, the exponential distribution models the time to failure in complex systems.",
      "In machine learning, the exponential distribution is used as a prior in Bayesian inference."
    ],
    "commonMistakes": [
      "Don't confuse the exponential distribution with the Poisson distribution, which models the number of events occurring within a fixed interval."
    ],
    "estimatedMinutes": 2,
    "difficulty": 2,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T23:58:30.648Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "prob_con_exponential_002",
    "subject": "probability",
    "type": "concept",
    "chapter": "continuous_random_variables",
    "topic": "exponential",
    "title": "Exponential Distribution",
    "contentHtml": "<p>The exponential distribution is a fundamental concept in probability theory that describes a continuous random variable with a memoryless property.</p><p>This means that the probability of an event occurring does not depend on when it occurred, only on the time elapsed since the last occurrence. This property makes the exponential distribution useful for modeling phenomena like the time between events or the duration until a specific event occurs.</p>",
    "formula": {
      "latex": "\\[f(x) = \\lambda e^{-\\lambda x} \\]",
      "name": "Probability Density Function"
    },
    "intuition": "The exponential distribution is often used to model phenomena that have a constant rate of occurrence over time. For example, the time between customer arrivals at a store or the duration until a machine fails.",
    "realWorldApplications": [
      "Modeling the time between events in reliability engineering",
      "Analyzing the duration until a specific event occurs in finance"
    ],
    "commonMistakes": [
      "Confusing the exponential distribution with the Poisson distribution",
      "Not understanding the memoryless property and its implications"
    ],
    "estimatedMinutes": 2,
    "difficulty": 2,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T23:58:47.851Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "prob_con_exponential_003",
    "subject": "probability",
    "type": "concept",
    "chapter": "continuous_random_variables",
    "topic": "exponential",
    "title": "Exponential Distribution",
    "contentHtml": "<p>The exponential distribution is a continuous probability distribution that models the time between events in a memoryless system.</p><p>This means that the probability of an event occurring does not depend on the time elapsed since the last event, only on the total time passed.</p>",
    "formula": {
      "latex": "\\[f(x) = \\lambda e^{-\\lambda x}\\]",
      "name": "Probability Density Function"
    },
    "intuition": "The exponential distribution is often used to model the time between arrivals in a Poisson process, where events occur independently and at a constant rate.",
    "realWorldApplications": [
      "Modeling the time between customer arrivals in a call center"
    ],
    "commonMistakes": [
      "Confusing the exponential distribution with the uniform distribution"
    ],
    "estimatedMinutes": 2,
    "difficulty": 2,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T23:59:01.582Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  }
]