[
  {
    "id": "stat_con_population_sample_001",
    "subject": "statistics",
    "type": "concept",
    "chapter": "sampling_distributions",
    "topic": "population_sample",
    "title": "Population and Sample: Understanding Parameters vs Statistics",
    "contentHtml": "<p>In statistics, we often deal with two types of values: parameters and statistics. <i>Parameters</i> describe a population's characteristics, while <i>statistics</i> describe the characteristics of a sample drawn from that population.</p><p>The key difference lies in their scope: parameters are properties of the entire population, whereas statistics are properties of the sample.</p>",
    "formula": {
      "latex": "\\(\\mu_\\text{pop} = \\frac{1}{N} \\sum_{i=1}^N x_i\\)",
      "name": "Population mean",
      "variants": []
    },
    "intuition": "Understanding the distinction between parameters and statistics is crucial for making informed decisions about a population based on sample data.",
    "realWorldApplications": [
      "In machine learning, we often use samples to train models that generalize well to the entire population."
    ],
    "commonMistakes": [
      "Failing to recognize the difference between parameters and statistics can lead to incorrect conclusions or biased results."
    ],
    "estimatedMinutes": 2,
    "difficulty": 1,
    "mlRelevance": "important",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T08:48:18.413Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "stat_con_population_sample_002",
    "subject": "statistics",
    "type": "concept",
    "chapter": "sampling_distributions",
    "topic": "population_sample",
    "title": "Population and Sample: Parameters vs Statistics",
    "contentHtml": "<p>In statistics, we often deal with two types of values: parameters and statistics.</p><p>Parameters are characteristics of a population, such as the average height of all humans or the proportion of people who prefer coffee over tea. Statistics, on the other hand, are values calculated from a sample of data, like the average height of a group of 100 people or the proportion of coffee drinkers in that same group.</p>",
    "formula": "{",
    "latex": "\\\\( \\mu = \\\\frac{1}{n} \\\\sum_{i=1}^n x_i \\\\)\" },",
    "intuition": "Understanding the difference between parameters and statistics is crucial for making informed decisions. By using a sample to estimate population characteristics, we can make predictions about future data without having to collect the entire dataset.",
    "realWorldApplications": [
      "Machine learning models often rely on samples of training data to make predictions about new, unseen data."
    ],
    "commonMistakes": [
      "Failing to recognize that parameters are fixed for a given population, while statistics vary depending on the sample"
    ],
    "difficulty": 1,
    "mlRelevance": "important",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T08:48:33.268Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "stat_con_population_sample_003",
    "subject": "statistics",
    "type": "concept",
    "chapter": "sampling_distributions",
    "topic": "population_sample",
    "title": "Population and Sample: Parameters vs Statistics",
    "contentHtml": "<p>In statistics, we often deal with two types of values: parameters and statistics.</p><p>Parameters are fixed values that describe a population, such as the average height of all humans. Statistics, on the other hand, are calculated values based on a sample from the population.</p>",
    "formula": "{",
    "latex": "\\\\( \\mu = \\\\frac{1}{n} \\\\sum_{i=1}^n x_i \\\\) (population mean)\",",
    "name": "Population Mean",
    "variants": "[] },",
    "intuition": "Understanding the difference between parameters and statistics is crucial for making informed decisions. By using a sample to estimate population characteristics, we can make predictions about future data.",
    "realWorldApplications": [
      "In machine learning, we often use samples of data to train models that will be applied to larger populations."
    ],
    "commonMistakes": [
      "Failing to recognize the distinction between parameters and statistics can lead to incorrect conclusions."
    ],
    "difficulty": 1,
    "mlRelevance": "important",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T08:48:47.247Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  }
]