[
  {
    "id": "stat_con_sampling_methods_001",
    "subject": "statistics",
    "type": "concept",
    "chapter": "sampling_distributions",
    "topic": "sampling_methods",
    "title": "Sampling Methods",
    "contentHtml": "<p>When collecting data from a population, we often use sampling methods to select a subset of individuals or units that represent the larger group. There are several types of sampling methods, each with its own strengths and weaknesses.</p><p>The most common method is simple random sampling (SRS), where every unit in the population has an equal chance of being selected. This approach ensures that our sample is representative of the population, but it can be time-consuming and expensive to implement.</p>",
    "formula": {
      "latex": "\\[\\frac{1}{n} \\sum_{i=1}^n x_i \\]",
      "name": "Sample Mean",
      "variants": []
    },
    "intuition": "Sampling methods help us make inferences about a population based on a smaller, more manageable sample. By choosing the right sampling method, we can ensure that our conclusions are generalizable to the larger group.",
    "realWorldApplications": [
      "Machine learning models often rely on representative samples of training data to generalize well to new, unseen instances."
    ],
    "commonMistakes": [
      "Failing to account for bias in the sampling process",
      "Assuming SRS is always the best approach"
    ],
    "estimatedMinutes": 2,
    "difficulty": 2,
    "mlRelevance": "important",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T09:08:06.104Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "stat_con_sampling_methods_002",
    "subject": "statistics",
    "type": "concept",
    "chapter": "sampling_distributions",
    "topic": "sampling_methods",
    "title": "Sampling Methods",
    "contentHtml": "<p>When collecting data from a population, we often use sampling methods to reduce the number of observations needed while still maintaining representativeness.</p><p>Simple random sampling, stratified sampling, cluster sampling, and systematic sampling are four common techniques used in statistical analysis.</p>",
    "formula": "{",
    "latex": "\\(n\\) is the sample size, \\(N\\) is the population size\" },",
    "intuition": "Sampling methods help us make informed decisions about our data without having to collect data from every individual in the population.",
    "realWorldApplications": [
      "Machine learning models often rely on sampling techniques to train and test their algorithms"
    ],
    "commonMistakes": [
      "Failing to account for potential biases in the sampling method",
      "Assuming that a small sample size is representative of the entire population"
    ],
    "difficulty": 2,
    "mlRelevance": "important",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T09:08:18.214Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "stat_con_sampling_methods_003",
    "subject": "statistics",
    "type": "concept",
    "chapter": "sampling_distributions",
    "topic": "sampling_methods",
    "title": "Sampling Methods",
    "contentHtml": "<p>Sampling is a fundamental concept in statistical inference, allowing us to make conclusions about an entire population based on a subset of data.</p><p>There are several sampling methods, each with its own strengths and weaknesses. In this card, we'll explore simple random, stratified, cluster, and systematic sampling.</p>",
    "formula": "{",
    "latex": "\\(n\\)\",",
    "name": "Sample size\" },",
    "intuition": "Sampling allows us to make inferences about the population by analyzing a representative subset of data. This is crucial in machine learning and artificial intelligence applications where we often work with limited datasets.",
    "realWorldApplications": [
      "Estimating customer satisfaction through surveys",
      "Analyzing medical data for disease diagnosis"
    ],
    "commonMistakes": [
      "Assuming all sampling methods are equally effective",
      "Not considering the impact of bias on sample results"
    ],
    "difficulty": 2,
    "mlRelevance": "important",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T09:08:30.915Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  }
]