[
  {
    "id": "stat_con_sampling_distribution_mean_001",
    "subject": "statistics",
    "type": "concept",
    "chapter": "sampling_distributions",
    "topic": "sampling_distribution_mean",
    "title": "Sampling Distribution of the Mean",
    "contentHtml": "<p>The sampling distribution of the mean is a fundamental concept in statistical inference.</p><p>Given a population with mean μ and standard deviation σ, we can draw random samples of size n from this population. The sample means x̄ will follow a normal distribution with mean μ and standard deviation σ / √n, known as the sampling distribution of the mean.</p>",
    "formula": "{",
    "latex": "\\( \\bar{x} \\sim N(\\mu, \\frac{\\sigma}{\\sqrt{n}}) \\)\",",
    "name": "Sampling Distribution\" },",
    "intuition": "The sampling distribution of the mean represents the variability in sample means when drawing multiple samples from a population. This concept is crucial in statistical inference as it allows us to make inferences about the population mean based on the sample mean.",
    "realWorldApplications": [
      "In machine learning, this concept is used to estimate the expected performance of a model by generating multiple samples and calculating their means."
    ],
    "commonMistakes": [
      "Failing to recognize that the sampling distribution of the mean is normal even when the population is not normally distributed."
    ],
    "difficulty": 2,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T08:50:29.067Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "stat_con_sampling_distribution_mean_002",
    "subject": "statistics",
    "type": "concept",
    "chapter": "sampling_distributions",
    "topic": "sampling_distribution_mean",
    "title": "Sampling Distribution of the Mean",
    "contentHtml": "<p>The sampling distribution of the mean is a fundamental concept in statistical inference.</p><p>Given a population with mean μ and standard deviation σ, we can draw multiple random samples of size n from this population. The sample means X̄ will follow a normal distribution with mean μ and standard error SE = σ / √n.</p>",
    "formula": "{",
    "latex": "\\(SE = \\frac{\\sigma}{\\sqrt{n}}\\)\",",
    "name": "Standard Error\" },",
    "intuition": "This concept matters because it allows us to make inferences about the population mean based on a single sample. In machine learning, this is crucial for model evaluation and selection.",
    "realWorldApplications": [
      "Model evaluation in regression analysis"
    ],
    "commonMistakes": [
      "Failing to account for the standard error when making inferences"
    ],
    "difficulty": 2,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T08:50:42.097Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "stat_con_sampling_distribution_mean_003",
    "subject": "statistics",
    "type": "concept",
    "chapter": "sampling_distributions",
    "topic": "sampling_distribution_mean",
    "title": "Sampling Distribution of the Mean",
    "contentHtml": "<p>The sampling distribution of the mean is a fundamental concept in mathematical statistics that describes the distribution of sample means from a population.</p><p>Intuitively, when we take multiple samples from a population, each sample will have its own mean. The sampling distribution of the mean shows how these sample means are distributed around the true population mean.</p>",
    "formula": {
      "latex": "\\[ \\bar{X} \\sim N\\left(\\mu, \\frac{\\sigma^2}{n}\\right) \\]",
      "name": "Sampling Distribution of the Mean"
    },
    "intuition": "The sampling distribution of the mean is a normal distribution with a mean equal to the true population mean and a standard error that depends on the sample size.",
    "visualDescription": "A diagram showing the normal distribution of sample means around the true population mean, with the standard error represented by the spread of the distribution.",
    "commonMistakes": [
      "Forgetting that the sampling distribution is approximately normal for large samples",
      "Not considering the impact of the sample size on the standard error"
    ],
    "realWorldApplications": [
      "Estimating population means in machine learning and data science applications"
    ],
    "estimatedMinutes": 2,
    "difficulty": 2,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T08:50:58.274Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  }
]