[
  {
    "id": "prob_con_clt_001",
    "subject": "probability",
    "type": "concept",
    "chapter": "limit_theorems",
    "topic": "clt",
    "title": "Central Limit Theorem",
    "contentHtml": "<p>The Central Limit Theorem (CLT) is a fundamental concept in probability theory that states that, given certain conditions, the distribution of the mean of independent and identically distributed random variables will converge to a normal distribution as the sample size increases.</p><p>In other words, even if the underlying distribution is not normal, the average of many samples will be approximately normally distributed. This has far-reaching implications in statistics, machine learning, and data analysis.</p>",
    "formula": {
      "latex": "\\[\\lim_{n \\to \\infty} P\\left(\\frac{\\bar{x}-\\mu}{\\sigma/\\sqrt{n}} \\leq x\\right) = \\Phi(x)\\]",
      "name": "CLT Formula",
      "variants": []
    },
    "intuition": "The CLT is often misunderstood as saying that the mean of a large sample will be normally distributed. Instead, it says that the distribution of the mean (i.e., the average) will converge to normality.",
    "realWorldApplications": [
      "In machine learning, the CLT is used to justify the use of Gaussian distributions in modeling and inference."
    ],
    "tags": [
      "probability",
      "statistics"
    ],
    "estimatedMinutes": 2,
    "difficulty": 3,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T01:49:02.772Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "prob_con_clt_002",
    "subject": "probability",
    "type": "concept",
    "chapter": "limit_theorems",
    "topic": "clt",
    "title": "Central Limit Theorem",
    "contentHtml": "<p>The Central Limit Theorem (CLT) states that the average of a sufficiently large number of independent and identically distributed random variables will be approximately normally distributed.</p><p>This means that even if the individual distributions are not normal, the distribution of the mean will converge to a normal distribution as the sample size increases.</p>",
    "formula": {
      "latex": "\\[\\bar{X} \\sim N(\\mu, \\\\frac{\\sigma^2}{n})\\]",
      "name": "CLT Formula"
    },
    "theorem": {
      "statement": "\\[\\lim_{n \\to \\infty} P\\left(\\sqrt{n}\\left|\\frac{\\bar{X}-\\mu}{\\sigma} \\right| &lt; k\\right) = \\Phi(k)\\]",
      "proofSketch": "The proof involves showing that the sum of independent random variables can be approximated by a normal distribution using the Lindeberg-Feller theorem."
    },
    "intuition": "The CLT matters because it allows us to model real-world phenomena with a normal distribution, even if the underlying data is not normally distributed. This has significant implications for statistical inference and machine learning algorithms.",
    "realWorldApplications": [
      "In natural language processing, the CLT can be used to model the distribution of word frequencies in a large corpus."
    ],
    "estimatedMinutes": 2,
    "difficulty": 3,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T01:49:24.117Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "prob_con_clt_003",
    "subject": "probability",
    "type": "concept",
    "chapter": "limit_theorems",
    "topic": "clt",
    "title": "Central Limit Theorem",
    "contentHtml": "<p>The Central Limit Theorem (CLT) is a cornerstone of probability theory, stating that under certain conditions, the distribution of the mean of independent and identically distributed random variables will converge to a normal distribution.</p><p>This theorem has far-reaching implications in statistics, machine learning, and data analysis, as it provides a framework for understanding the behavior of sample means and their relationship to population parameters.</p>",
    "formula": {
      "latex": "\\[\\lim_{n \\to \\infty} P\\left(\\frac{\\sum_{i=1}^n X_i - n\\mu}{\\sqrt{n}\\sigma} \\leq x\\right) = \\Phi(x)\\]",
      "name": "CLT Formula"
    },
    "intuition": "The CLT provides a powerful tool for understanding the behavior of sample means, allowing us to make inferences about population parameters. This is particularly important in machine learning, where we often rely on sample means to estimate population parameters.",
    "realWorldApplications": [
      "Estimating population means from large datasets",
      "Understanding the behavior of sample means in statistical modeling"
    ],
    "commonMistakes": [
      "Assuming the CLT applies to all distributions",
      "Not considering the conditions for the CLT to hold"
    ],
    "estimatedMinutes": 2,
    "difficulty": 3,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-27T01:49:43.666Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  }
]