[
  {
    "id": "la_prb_svd_properties_006",
    "subject": "linear_algebra",
    "type": "problem",
    "chapter": "matrix_decompositions",
    "topic": "svd_properties",
    "problem": "{",
    "statementHtml": "Find the rank and null space of a matrix A using its SVD decomposition.",
    "hints": [
      "Think about how the singular values relate to the matrix's rank.",
      "The null space is spanned by the vectors in the left singular matrices.",
      "Use the fact that the right singular vectors are orthonormal."
    ],
    "solutionHtml": " Suppose A has SVD decomposition $A = U \\Sigma V^T$. The rank of A is equal to the number of non-zero singular values. Therefore, the rank of A is $\\mathrm{rank}(A) = k$, where $k$ is the number of non-zero entries in $\\Sigma$.  The null space of A is spanned by the vectors in the left singular matrices. Since $U$ has orthonormal columns, its null space is trivial ($\\mathrm{nullity}(U) = 0$). Therefore, the null space of A is also trivial.  The range of A is equal to the column space of V (since $\\Sigma V^T$ is the product of two matrices with orthonormal columns). The dimension of this subspace is $k$, which is the rank of A. \",",
    "answerShort": "Rank: k, Null Space: trivial\" },",
    "difficulty": 4,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T13:46:59.954Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "la_prb_svd_properties_007",
    "subject": "linear_algebra",
    "type": "problem",
    "chapter": "matrix_decompositions",
    "topic": "svd_properties",
    "problem": {
      "statementHtml": "<p>Given a matrix A with SVD decomposition UΣV<sup>T</sup>, prove that the rank of A is equal to the number of non-zero singular values in Σ.</p>",
      "hints": [
        "Consider the definition of rank and the properties of SVD.",
        "Think about how the null space and range of A relate to the columns of U and V.",
        "Use the fact that Σ is a diagonal matrix to simplify your calculation."
      ],
      "solutionHtml": "<p>To prove this, we can start by recalling that the rank of A is equal to the dimension of its column space. From SVD, we know that the column space of A is spanned by the columns of V.</p><p>Since Σ is diagonal, it has no effect on the null space or range of A, so we can focus on the columns of V.</p><p>The rank of A is then equal to the number of non-zero singular values in Σ, since these correspond to the linearly independent columns of V.</p>",
      "answerShort": "The answer is..."
    },
    "commonMistakes": [
      "Forgetting that Σ is diagonal and only considering the null space or range.",
      "Not recognizing that the number of non-zero singular values in Σ corresponds to the dimension of the column space."
    ],
    "difficulty": 4,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T13:47:17.690Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "la_prb_svd_properties_008",
    "subject": "linear_algebra",
    "type": "problem",
    "chapter": "matrix_decompositions",
    "topic": "svd_properties",
    "problem": "{",
    "statementHtml": "Find the rank and null space of a matrix <code>A</code> using its SVD decomposition.",
    "hints": [
      "Recall that the rank of a matrix is equal to the number of singular values greater than zero.",
      "The null space of a matrix is spanned by the right-singular vectors corresponding to zero singular values.",
      "Use the fact that the range of a matrix is spanned by its column vectors."
    ],
    "solutionHtml": "<p>Let <code>A</code> be an <code>m \\* n</code> matrix with SVD decomposition <code>A = U &Sigma; V<sup>T</sup></code>. The rank of <code>A</code> is equal to the number of singular values greater than zero, which is equal to the rank of <code>&Sigma;</code>.</p><p>The null space of <code>A</code> is spanned by the right-singular vectors corresponding to zero singular values. Since the diagonal entries of <code>&Sigma;</code> are the singular values, the null space of <code>A</code> is equal to the column space of <code>V</code>.</p><p>The range of <code>A</code> is spanned by its column vectors, which are the columns of <code>V</code>. Therefore, the range of <code>A</code> is equal to the column space of <code>V</code>.</p>\",",
    "answerShort": "The rank and null space of <code>A</code> can be found from its SVD decomposition.\" },",
    "difficulty": 4,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T13:47:40.236Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "la_prb_svd_properties_009",
    "subject": "linear_algebra",
    "type": "problem",
    "chapter": "matrix_decompositions",
    "topic": "svd_properties",
    "problem": {
      "statementHtml": "<p>Given a matrix A with SVD decomposition USV<sup>T</sup>, show that the rank of A is equal to the number of non-zero singular values.</p>",
      "hints": [
        "Think about the geometric interpretation of the SVD.",
        "Consider the relationship between the null space and range of A.",
        "Use the fact that the rank of a matrix is equal to the dimension of its column space."
      ],
      "solutionHtml": "<p>To prove this, we can start by noting that the rank of A is equal to the number of columns in U.</p><p>Since USV<sup>T</sup> is an SVD decomposition, we know that SV<sup>T</sup> has only non-zero singular values on its diagonal.</p><p>This means that the range of A (which is spanned by the columns of V) has dimension equal to the number of non-zero singular values.</p><p>By definition, this is also the rank of A.</p>",
      "answerShort": "The rank of A is equal to the number of non-zero singular values."
    },
    "commonMistakes": [
      "Forgetting that the SVD decomposition is unique up to permutation and scaling.",
      "Not recognizing that the null space of A is orthogonal to its range."
    ],
    "difficulty": 4,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T13:47:57.815Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  }
]