[
  {
    "id": "prob_con_conditional_independence_001",
    "subject": "probability",
    "type": "concept",
    "chapter": "conditional_probability",
    "topic": "conditional_independence",
    "title": "Conditional Independence",
    "contentHtml": "<p>In probability theory, conditional independence is a crucial concept that helps us understand how events are related when given additional information.</p><p>Intuitively, two random variables X and Y are conditionally independent given Z if the knowledge of Z 'decouples' their relationships. In other words, knowing Z doesn't provide any additional information about the relationship between X and Y.</p>",
    "formula": {
      "latex": "\\(X \\perp\\! Y | Z\\)",
      "name": "Conditional Independence"
    },
    "intuition": "Think of it like a conversation. When you're talking to someone, your friend's presence doesn't affect the topic of discussion unless there's a specific connection between them.",
    "realWorldApplications": [
      "In graphical models, conditional independence is used to simplify complex probability distributions and improve inference algorithms."
    ],
    "commonMistakes": [
      "Don't confuse conditional independence with unconditional independence. The latter only considers the variables themselves, not additional information."
    ],
    "tags": [
      "probability",
      "conditional"
    ],
    "estimatedMinutes": 2,
    "difficulty": 3,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T22:26:02.717Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "prob_con_conditional_independence_002",
    "subject": "probability",
    "type": "concept",
    "chapter": "conditional_probability",
    "topic": "conditional_independence",
    "title": "Conditional Independence",
    "contentHtml": "<p>In probability theory, conditional independence is a crucial concept that helps us understand how variables are related when given some additional information.</p><p>Intuitively, two random variables X and Y are conditionally independent given Z if the probability distribution of X and Y depends only on Z, not on each other.</p>",
    "formula": {
      "latex": "\\(X \\perp\\!\\! Y | Z\\)",
      "name": "Conditional Independence"
    },
    "intuition": "Think of it like a conversation: when you're given some context (Z), the topics discussed by X and Y become irrelevant to each other.",
    "realWorldApplications": [
      "In graphical models, conditional independence is used to define the structure of Bayesian networks."
    ],
    "commonMistakes": [
      "Don't confuse conditional independence with unconditional independence!"
    ],
    "tags": [
      "probability",
      "graphical models"
    ],
    "estimatedMinutes": 2,
    "difficulty": 3,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T22:26:18.191Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "prob_con_conditional_independence_003",
    "subject": "probability",
    "type": "concept",
    "chapter": "conditional_probability",
    "topic": "conditional_independence",
    "title": "Conditional Independence",
    "contentHtml": "<p>In probability theory, conditional independence is a crucial concept that helps us understand relationships between random variables.</p><p>Given two sets of variables X and Y, we say they are conditionally independent given Z if the probability distribution of X and Y depends only on Z. Mathematically, this can be expressed as:</p>\\(P(X \\perp Y | Z) = P(X | Z) P(Y | Z)\\)<p>This concept is essential in graphical models, where it helps us simplify complex relationships between variables.</p>\",",
    "formula": "{",
    "latex": "\\(P(X \\perp Y | Z) = P(X | Z) P(Y | Z)\\)\",",
    "name": "Conditional Independence Formula\" },",
    "intuition": "Think of conditional independence as saying that once we know the value of Z, X and Y become independent. This is useful in modeling complex systems where there are multiple variables interacting with each other.",
    "realWorldApplications": [
      "In machine learning, conditional independence helps us identify features that are not correlated with each other, which can improve model performance."
    ],
    "commonMistakes": [
      "Don't confuse conditional independence with unconditional independence. The latter only considers the joint distribution of X and Y, whereas the former takes into account a third variable Z."
    ],
    "difficulty": 3,
    "mlRelevance": "core",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T22:26:37.881Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  }
]