[
  {
    "id": "prob_thm_pairwise_mutual_004",
    "subject": "probability",
    "type": "theorem",
    "chapter": "conditional_probability",
    "topic": "pairwise_mutual",
    "title": "Pairwise vs Mutual Independence",
    "contentHtml": "<p>In probability theory, independence is a crucial concept that helps us understand how events relate to each other. There are two types of independence: pairwise and mutual.</p><p>Pairwise independence means that the occurrence of one event does not affect the probability of another event. On the other hand, mutual independence implies that all events in a set are independent from each other.</p>",
    "formula": "{",
    "latex": "\\\\(P(A \\cap B) = P(A) \\cdot P(B)\\\\)\",",
    "name": "Pairwise Independence Formula\" },",
    "theorem": "{",
    "statement": "\\[P(A_1, A_2, ..., A_n) = \\\\prod_{i=1}^n P(A_i)\\]\",",
    "proofSketch": "The proof involves showing that the probability of a conjunction is equal to the product of individual probabilities.\" },",
    "intuition": "Mutual independence is more restrictive than pairwise independence. While pairwise independence only requires that each pair of events be independent, mutual independence demands that all events in the set be independent from each other.",
    "realWorldApplications": [
      "In machine learning, understanding mutual independence is crucial for modeling complex relationships between variables."
    ],
    "tags": [
      "probability",
      "independence"
    ],
    "difficulty": 3,
    "mlRelevance": "important",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T22:30:05.402Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  },
  {
    "id": "prob_thm_pairwise_mutual_005",
    "subject": "probability",
    "type": "theorem",
    "chapter": "conditional_probability",
    "topic": "pairwise_mutual",
    "title": "Pairwise vs Mutual Independence",
    "contentHtml": "<p>In probability theory, understanding independence is crucial for many applications. This theorem distinguishes between pairwise and mutual independence.</p><p>When events are independent in pairs but not necessarily jointly, we say they're pairwise independent. On the other hand, if events are independent regardless of how many are involved, we have mutual independence.</p>",
    "formula": "{",
    "latex": "\\\\(P(A \\cap B) = P(A)P(B)\\\\)\",",
    "name": "Pairwise Independence\" },",
    "theorem": "{",
    "statement": "\\[A_1, A_2, \\\\ldots are pairwise independent if and only if P(\\\\bigcap_{i=1}^n A_i) = \\\\prod_{i=1}^n P(A_i) for all n \\\\geq 1.\\]\",",
    "proofSketch": "The proof involves showing that pairwise independence implies mutual independence, and vice versa.\" },",
    "intuition": "Intuitively, pairwise independence means that the probability of one event doesn't affect the other, even if they both occur. Mutual independence takes this a step further by saying that any number of events are independent.",
    "difficulty": 3,
    "mlRelevance": "important",
    "prerequisites": [],
    "relatedCards": [],
    "nextCards": [],
    "generatedAt": "2025-12-26T22:30:25.035Z",
    "generatedBy": "llama3:latest",
    "reviewed": false,
    "version": 1
  }
]